Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    
   
    Если Не ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда
        Сообщить("Ошибка: Не заполнено поле 'Наименование' (ФИО сотрудника)!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
       Если Не ЗначениеЗаполнено(ЭтотОбъект.Отдел) Тогда
        Сообщить("Ошибка: Не выбран 'Отдел' для сотрудника!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
     
    Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаРождения) Тогда
        Сообщить("Ошибка: Не заполнена 'Дата рождения' сотрудника!");
        Отказ = Истина;
        Возврат;
	КонецЕсли; 
 Если Не ЗначениеЗаполнено(ЭтотОбъект.Должность) Тогда
        Сообщить("Ошибка: Не заполнена 'Должность' сотрудника!");
        Отказ = Истина;
        Возврат;
	КонецЕсли;
	 Если Не ЗначениеЗаполнено(ЭтотОбъект.СтатусСотрудника) Тогда
        Сообщить("Ошибка: Не заполнена 'СтатусСотрудника' сотрудника!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;	

КонецПроцедуры