Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	
	ПараметрТоп = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КоличествоТоп"));
	ПоказыватьТоп = Ложь;
	
	Если ПараметрТоп <> Неопределено И ПараметрТоп.Значение <> Неопределено И ПараметрТоп.Значение > 0 Тогда
		ПоказыватьТоп = Истина;
	КонецЕсли;
	
	// Получаем схему и модифицируем текст запроса
	Схема = ПолучитьМакет("ОсновнойМакетОтчета");
	ТекстЗапроса = Схема.НаборыДанных.НаборДанных1.Запрос;
	
	Если ПоказыватьТоп Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоличествоТоп,", "ПЕРВЫЕ"+" "+ПараметрТоп.Значение);
	Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоличествоТоп,", "");
		
	КонецЕсли;
	
	
	Схема.НаборыДанных.НаборДанных1.Запрос = ТекстЗапроса;
	
	СтандартнаяОбработка = Ложь;
	Компоновщик = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = Компоновщик.Выполнить(Схема, Настройки);
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(Макет);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(Процессор);
	
КонецПроцедуры