
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	Индекс = Элементы.Товары.ТекущаяСтрока;
    Если Индекс <> Неопределено Тогда
        ПересчитатьСтрокуНаСервере(Индекс);
    КонецЕсли;
КонецПроцедуры
// ФормаДокумента.Поступление



&НаКлиенте
Процедура ТоварыЦенаЗакупкиПриИзменении(Элемент)
    Индекс = Элементы.Товары.ТекущаяСтрока;
    Если Индекс <> Неопределено Тогда
        ПересчитатьСтрокуНаСервере(Индекс);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокуНаСервере(ИндексСтроки)
    СтрокаТЧ = Объект.Товары[ИндексСтроки];
    СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаЗакупки;
КонецПроцедуры