&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
    
    СтандартнаяОбработка = Ложь;
    
    Данные = ПолучитьРасшифровкуНаСервере(Расшифровка);
    
    Если Данные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если Данные.Свойство("Товар") И ЗначениеЗаполнено(Данные.Товар) Тогда
        Сообщить("Выбран товар: " + Данные.Товар );
        Возврат;
    КонецЕсли;
    
КонецПроцедуры
&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка)
    
      АдресХранилища = ДанныеРасшифровки;
    
    ДанныеРасш = ПолучитьИзВременногоХранилища(АдресХранилища);
    
    Если ТипЗнч(ДанныеРасш) <> Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    ЭлементРасшифровки = ДанныеРасш.Элементы[Расшифровка];
    
    Если ЭлементРасшифровки = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
       РезультатСтруктура = Новый Структура;
    
       Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
        Поля = ЭлементРасшифровки.ПолучитьПоля();
        Для Каждого ЗначениеПоля Из Поля Цикл
            РезультатСтруктура.Вставить(ЗначениеПоля.Поле, ЗначениеПоля.Значение);
        КонецЦикла;
    КонецЕсли;
    
    Возврат РезультатСтруктура;
    
КонецФункции