
Процедура РуководительСогласовалПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат=Истина;
КонецПроцедуры

Процедура ПодтверждениеКадровогоПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СогласованиеРуководителемПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача из ФормируемыеЗадачи Цикл
	
	Задача.Исполнитель =Сотрудник.Руководитель.Пользователь;
	Задача.Сотрудник= Сотрудник;   
		Задача.СрокИсполнения= ТекущаяДата() + 86400*3;

	Задача.Описание="Согласовать отпуск" + Сотрудник.Наименование;	
	КонецЦикла;
	КонецПроцедуры

	Процедура ПодтверждениеКадровогоПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	 Запрос = Новый Запрос;
    Запрос.Текст = 
   "ВЫБРАТЬ ПЕРВЫЕ 1
|    Сотрудники.Ссылка КАК Ссылка
|ИЗ
|    Справочник.Сотрудники КАК Сотрудники
|ГДЕ
|    Сотрудники.Должность.Наименование ПОДОБНО ""%кадр%""
|    ИЛИ Сотрудники.Должность.Наименование ПОДОБНО ""%HR%""";   
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() Тогда
        Для Каждого Задача Из ФормируемыеЗадачи Цикл
            Задача.Исполнитель = Выборка.Ссылка;
            Задача.Наименование = "Подтвердить отпуск: " + Сотрудник.Наименование;
        КонецЦикла;
    Иначе
        Отказ = Истина;
        Сообщить("Не найден сотрудник кадрового отдела!");
    КонецЕсли;
	КонецПроцедуры

	Процедура HRПодтвердилПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат=Истина;

	КонецПроцедуры
	
	
