Процедура УстановкаПараметровСеанса(ТребуемыеПараметры) Экспорт
    
    // ✅ Вызываем серверную функцию — она сделает всё сама
    МодульРаботыСЗадачами.ПолучитьТекущегоПользователя();
    
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
    
    Если НЕ МодульРаботыСЗадачами.ЭтоАдминистратор() Тогда
        
        МассивЗадач = МодульРаботыСЗадачами.ПолучитьВсеЗадачиССылками();
                НавигационнаяСсылка = МодульРаботыСЗадачами.ПолучитьНавигационнуюСсылкуСпискаЗадач();
        Если МассивЗадач.Количество() > 0 Тогда
            
            // Формируем текст со списком задач
            ТекстЗадач = "У вас есть задачи:" + Символы.ПС;
            Для Каждого СтрокаЗадачи Из МассивЗадач Цикл
                ТекстЗадач = ТекстЗадач + "• " + СтрокаЗадачи.Ссылка + Символы.ПС;
            КонецЦикла;
            
          
			
			ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
			ПоказатьПредупреждение(
                ,
                "Вам назначено задач: " + МассивЗадач.Количество(),
                0,
                ТекстЗадач
            );  
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗакрытияПредупреждения(Результат, НавигационнаяСсылка) Экспорт
    ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
КонецПроцедуры