// ДокументОбъект.Поступление

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
       
    
        Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    Если Поставщик = Справочники.Контрагенты.ПустаяСсылка() Тогда
        Сообщить("Выберите поставщика!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Склад = Справочники.Склады.ПустаяСсылка() Тогда
        Сообщить("Выберите склад!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Товары.Количество() = 0 Тогда
        Сообщить("Добавьте хотя бы один товар!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
       ПересчитатьСуммы();
    
    Для Каждого СтрокаТЧ Из Товары Цикл
        Если СтрокаТЧ.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
            Сообщить("В одной из строк не выбрана номенклатура!");
            Отказ = Истина;
            Возврат;
        КонецЕсли;
        
        Если СтрокаТЧ.Количество <= 0 Тогда
            Сообщить("Количество должно быть больше 0!");
            Отказ = Истина;
            Возврат;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    // Формирование движений по регистру
    СформироватьДвижения();
     Движения.ТоварыНаСкладе.Записывать = Истина; 
КонецПроцедуры

Процедура ОбработкаОтменыПроведения(Отказ, РежимОтменыПроведения)
    // Очистка движений
    Движения.ТоварыНаСкладе.Очистить();
КонецПроцедуры

Процедура СформироватьДвижения()
       Для Каждого СтрокаТЧ Из Товары Цикл
        Движение = Движения.ТоварыНаСкладе.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Склад = Склад;
        Движение.Номенклатура = СтрокаТЧ.Номенклатура;
        Движение.Количество = СтрокаТЧ.Количество;
        Движение.Сумма = СтрокаТЧ.Сумма;
        Движение.ОбщаяСтоимость = СтрокаТЧ.Сумма;
        Движение.ДокументПоступления = Ссылка;
      
    КонецЦикла;
КонецПроцедуры

Процедура ПересчитатьСуммы()
    Для Каждого СтрокаТЧ Из Товары Цикл
        СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаЗакупки;
    КонецЦикла;
КонецПроцедуры