Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // 1. Создаем бизнес-процесс
  ОбъектБП = БизнесПроцессы.СогласованиеОтпуска.СоздатьБизнесПроцесс();

// 2. Заполняем реквизиты у ОБЪЕКТА, а не у ссылки 
ОбъектБП.Дата = ТекущаяДата();
ОбъектБП.Сотрудник = Сотрудник;
ОбъектБП.ДокументЗаявки = Ссылка;
ОбъектБП.Руководитель = Руководитель;

// 3. Записываем объект (только теперь он становится ссылкой в базе)
ОбъектБП.Записать();
 БизнесПроцесс = ОбъектБП.Ссылка; 
 Записать(РежимЗаписиДокумента.Запись);
// 4. Запускаем бизнес-процесс
ОбъектБП.Старт();
    
КонецПроцедуры  

