////////////////////////////////////////////////////////////////////////////////
// Модуль объекта справочника Клиенты

// Проверка дублей при записи
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    // Пропускаем проверки при загрузке через обмен данными
    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    
    // Вызываем экспортную функцию из модуля менеджера
    Справочники.Клиенты.ПриЗаписиПроверитьДубли(ЭтотОбъект, Отказ);
    
    // Если дубль найден, Отказ уже установлен в Истина
    // Можно добавить дополнительные проверки
     Если ПустаяСтрока(Наименование) Тогда
        Сообщить("Введите наименование клиента!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если ПустаяСтрока(ИНН) Тогда
        Сообщить("Введите ИНН клиента!");
        Отказ = Истина;
        Возврат;
    КонецЕсли; 
КонецПроцедуры