// Отчет.ОтчетПоОстаткам.Форма.ФормаОтчета


&НаКлиенте
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
       ДатаНачало = НачалоМесяца(ТекущаяДата());
    ДатаКонец = КонецМесяца(ТекущаяДата());
    Склад = Неопределено;
    
       Результат = Новый ТабличныйДокумент;
    Результат.ОтображатьЗаголовки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
        Сформировать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
      Если Склад = Неопределено ИЛИ Склад.Пустая() Тогда
        Сообщить("⚠️ Выберите склад!");
        Возврат;
    КонецЕсли;
    
    ВыполнитьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОтчетНаСервере()
    Схема = Отчеты.ОстаткиТоваров.ПолучитьМакет("МакетОтчета");
    
      Настройки = Схема.НастройкиПоУмолчанию;
    Попытка
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Склад", Склад);
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
    Компоновщик = Новый КомпоновщикМакетаКомпоновкиДанных;
    Макет = Компоновщик.Выполнить(Схема);
    
     Процессор = Новый ПроцессорКомпоновкиДанных;
    Процессор.Инициализировать(Макет);
    
    Результат = Новый ТабличныйДокумент;
   
    Исключение
    	Сообщить(ОписаниеОшибки());
    КонецПопытки;
      ЭтотОбъект.Результат = Результат;
КонецПроцедуры



&НаКлиенте
Процедура Очистить(Команда)
    ДатаНачало = НачалоМесяца(ТекущаяДата());
    ДатаКонец = КонецМесяца(ТекущаяДата());
    Склад = Неопределено;
    Результат = Новый ТабличныйДокумент;
    Результат.ОтображатьЗаголовки = Истина;
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
    Сформировать(Команда);
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьВExcel(Команда)
    Если Результат = Неопределено ИЛИ Результат.ВысотаТаблицы = 0 Тогда
        Сообщить("⚠️ Сначала сформируйте отчет!");
        Возврат;
    КонецЕсли;
    
    ВыгрузитьВExcelНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВExcelНаСервере()
    Попытка
        ИмяФайла = "Отчет_по_остаткам_" + Формат(ТекущаяДата(), "ДФ=ddMMyyyy") + ".xlsx";
        Путь = "C:\Users\" + ПользователиИнформационнойБазы.ТекущийПользователь().Имя + "\Desktop\" + ИмяФайла;
        
        Результат.Записать(Путь, ТипФайлаТабличногоДокумента.XLSX);
        Сообщить("Отчет выгружен: " + Путь);
    Исключение
        Сообщить("Ошибка выгрузки: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры