
&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
    ЗаполнитьРуководителя();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРуководителя()
    Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
        Объект.Руководитель = Объект.Сотрудник.Руководитель; 
		

    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
    РассчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаПриИзменении(Элемент)
    РассчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличествоДней()
    Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаКонца) Тогда
        Объект.КоличествоДней = Окр(((Объект.ДатаКонца- Объект.ДатаНачала + 1)/86400),0); 
		    Иначе
        Объект.КоличествоДней = 0;
	КонецЕсли;
	КонецПроцедуры
