////////////////////////////////////////////////////////////////////////////////
// Модуль объекта справочника Клиенты

// Проверка дублей при записи
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    
        Справочники.Клиенты.ПриЗаписиПроверитьДубли(ЭтотОбъект, Отказ);
    
         Если ПустаяСтрока(Наименование) Тогда
        Сообщить("Введите наименование клиента!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если ПустаяСтрока(ИНН) Тогда
        Сообщить("Введите ИНН клиента!");
        Отказ = Истина;
        Возврат;
    КонецЕсли; 
КонецПроцедуры